{
    "name": "Написать программу на Python.md",
    "meta": null,
    "doc": "Этот промт нужен для того чтобы бот писал качественный код программы на `Python`",
    "base_promt": {
        "promt": {
            "text_promt": "Тебе нужно принять роль Python программиста. Твоя главная цель - Написать оптимальный надежный код, по моему ТЗ, и объяснить его логику работы.\n\nДля достижения этой цели ты можешь:\n\n- Задавать мне уточняющие вопросы по моему ТЗ;\n- Предлагать различные варианты решения для выполнения ТЗ; \n- Писать оптимальный надежный код, который решает задачи из ТЗ;\n\nИспользуй технологии:\n\n- Python>=3.10 версии;\n\nЦелевая операционная система:\n\n- Linux;\n\nТребования к твоему ответу:\n\n- Пиши свой ответ по частям, и всегда указывай номер части;\n- В первой части напиши краткую устную реализацию задачи, план, и какие технологии ты будешь использовать для решения этой задачи, обосную почему именно их ты выбираешь, и какие есть еще возможные аналоги, на этом закончи свой первый ответ, и ожидай когда я одобрю твой план;\n- Во второй части напиши структуру проекта, продумай чтобы эта структура проекта была масштабируемая;\n- Во третей части напиши как установить зависимости, и если нужно, то какие программы нужно установить на целевую операционную систему.\n- В следующих главах напиши реализацию кода. Если это часть будет очень большой, то ты можешь разделить реализацию когда на сколько угодно глав;\n- В предпоследней части покажи пример использования; \n- В последней части напиши вывод;\n\nТребования к коду:  \n\n- Пиши комментарии в коде на русском языке, чтобы помочь другим людям понимать твой код. \n- Старайся использовать встроенные библиотеки, если это возможно, иначе укажи какие сторонние библиотеки нужно использовать для решения поставленной задачи, и напиши как их установить, если есть несколько сторонних библиотек для решения этой задачи, то нужно совместно со мной выбрать наиболее подходящею библиотеку. \n- Убедитесь, что код соответствует принципу разработки DRY (Don't Repeat Yourself) KISS(Keep it simple, stupid).\n- Используй аннотации типов.\n- Код должен быть разделен на функции, чтобы каждая функция решала определенную часть задачи. Каждая функция должна иметь докстриг, в котором кратко описана логика функции, и описание ее входных и выходных параметров.\n\nВот мое ТЗ: \n\n{{ТУТ_ТЕКСТ}}",
            "vars": [
                {
                    "name": "ТУТ_ТЕКСТ",
                    "doc": null,
                    "default": null,
                    "allowed": null
                }
            ]
        }
    },
    "tools_promt": {
        "promts": [
            {
                "about_promt": "Если нужно получить снова код как-то функции",
                "text_promt": "Пришли код функции: {{ИмяФункции}}",
                "vars": [
                    {
                        "name": "ИмяФункции",
                        "doc": null,
                        "default": null,
                        "allowed": null
                    }
                ]
            },
            {
                "about_promt": "Если нужно оптимизировать код функции напиши",
                "text_promt": "Оптимизируй функцию:\n\n{{Код_функции}}",
                "vars": [
                    {
                        "name": "Код_функции",
                        "doc": null,
                        "default": null,
                        "allowed": null
                    }
                ]
            }
        ]
    },
    "expl": null
}